let arr = [1, 2, 5, 0, 4, 5, 6];
let sum = 0;
arr.reduce((total, elem) => {
    if (elem > 0) {
        sum = total + elem;
        return sum;
    }
    else if (elem == 0) {
        console.log(`Сума перших 3-х елементів = ${sum}`);
    }
})

/*---------------------------------------------------------------*/
let arr2 = [1, 2, 3, 0, 4, 5, 6];
let sum2 = 0;
let ind = 1;
arr2.reduce((value, elem,) => {
    if (value < 10) {
        sum2 = value + elem;
        ind += 1;
        return sum2;
    }
    else if (value == 10) {
        console.log(`Кількість елементів при яких сума більша 10 = ${ind}`);
    }
})


// Завдання 6. Reduce

// Заданий масив з числами. Знайдіть суму перших N елементів до першого нуля. 

// Приклад: [1, 2, 3, 0, 4, 5, 6] - підсумовуємо перші 3 елементи, так як далі стоїть елемент з числом 0.

//     let arr = [1, 2, 5, 0, 4, 5, 6];

// Результат вивести в консоль.



// Заданий масив з числами. Дізнайтеся скільки елементів з початку масиву треба скласти, щоб в сумі вийшло більше 10-ти.

//     let arr = [1, 2, 3, 0, 4, 5, 6];

// Результат вивести в консоль.